Repository: enbata/wc-sermepa
Catalog: languages/wc_redsys_payment_gateway-*.po
Languages: eu

source: Credit card (TPV Redsys)
eu: Redsys bitartez ordaindu txartela erabiliz

source: Pay with credit card using Redsys TPV
eu: Redsys TPV bitartez txartelarekin ordaindu

source: Redsys works by sending the user to Redsys to enter their payment information.
eu: Plugin honek erabiltzailea Redsys pasarelara bideratzen du ordainketa burutzeko.

source: You'll find previous version (SHA1) <a href="https://github.com/jesusangel/wc-sermepa/archive/88112586ed7b4a90fe55d20f70fcea169c046c0c.zip" target="_blank">here</a>
eu: Aurreko bertsioa (SHA1) <a href="https://github.com/jesusangel/wc-sermepa/archive/88112586ed7b4a90fe55d20f70fcea169c046c0c.zip" target="_blank">hemen</a> aurkituko duzu

source: Gateway Disabled
eu: Pasarela desgaitua

source: Enable/Disable
eu: Gaitu/Desgaitu

source: Enable/Disable payment method.
eu: Gaitu/Desgaitu ordainketa modua.

source: Enable Redsys
eu: Redsys gaitu

source: Mode
eu: Funtzionamendu modua

source: Production
eu: Produkzioa

source: Test sis-t
eu: Frogak sis-t ingurunea erabiliz

source: Test sis-d
eu: Frogak sis-d ingurunea erabiliz

source: Test sis-i
eu: Frogak sis-i ingurunea erabiliz

source: TVP mode: production or test
eu: TPV funtzionamendu modua: produkzioa edo probak (sis-t, sis-d edo sis-i)

source: Notifications protocol
eu: Jakinarazpenen protokoloa

source: Protocol
eu: Protokoloa

source: Auto
eu: Automatikoa

source: Protocol to use by RedSYS notififications. HTTPS works only for sites with SSL and dedicated IP. Redsys doesn't work with SNI (22/05/2016)
eu: RedSsys -en jakinarazpenentzat URL helbidearen protokoloa. HTTPSa SSLa eta IP dedikatua (ez banatua) duten orriekin bakarrik dabil. RedSys -ek ez du onartzen SNIa (2016/05/22).

source: Title
eu: Titulua

source: This controls the title which the user sees during checkout.
eu: Honek erabiltzaleak erosketa bukaeran ikusten duen titulua kontrolatzen du.

source: Description
eu: Azalpena

source: This controls the description which the user sees during checkout.
eu: Honek erabiltzaileek erosketa bukaeran ikusten duten azalpena kontrolatzen du.

source: Payment gateway with Redsys credit card.
eu: Ordainketa pasarelaren (Redsys) bitartez, txartela erabiliz ordaindu.

source: Allowed payment methods
eu: Onartutako ordainketa moduak

source: Allowed payment methods.
eu: Onartutako ordainketa moduak.

source: All
eu: Denak

source: Only credit card
eu: Txartela bakarrik

source: Credit card and Iupay
eu: Txartela eta Iupay

source: Owner name
eu: Denda jabearen izena

source: Name and surname of the owner.
eu: Jabearen izen eta abizenak

source: Commerce name
eu: Dendaren zenbakia (FUC)

source: The commerce name.
eu: Dendaren zenbakia (FUC)

source: Commerce number (FUC)
eu: Dendaren zenbakia (FUC)

source: Terminal number
eu: Terminal zenbakia

source: Currency identifier
eu: Diruaren identifikatzailea

source: Secret key (SHA-256)
eu: Gako sekretua

source: Please enter your secret key; this is needed in order to take payment.
eu: Mesedez, adierazi zure Redsys gako sekretua, beharrezkoa da ordainketa jaso ahal izateko.

source: Enable languages
eu: Hizkuntzak aktibatu

source: Enable logging
eu: Log-a aktibatu

source: Log Redsys events, inside %s
eu: RedSys gertaerak gordetzeko kokalekua: %s

source: Online order
eu: Online erosketa

source: Redirecting&hellip;
eu: Birbideratzen&hellip;

source: Thank you for your order. We are now redirecting you to Redsys to make payment.
eu: Mila esker zure eskariagatik. Orain ordainketa pasarelara bideratuko zaitugu.

source: Pay via Redsys
eu: Redsys erabiliz ordaindu

source: Cancel order &amp; restore cart
eu: Erosketa ezeztatu

source: Thank you for your order, please click the button below to pay with Redsys.
eu: Mila esker zure eskariagatik. Mesedez, klikatu ordaintzeko botoiaren gainean.

source: Validation error: Redsys amounts do not match (amount %s).
eu: Balidazio errorea: kopuruak ez datoz bat (guztira %s).

source: Redsys payment completed
eu: Ordainketa eginda

source: Payment error: code: %s.
eu: Ordainketan errorea, kodea: %s.

source: Payment error: bank unavailable.
eu: Ordainketa errorea: bankua ez dago prest.

source: Awaiting REDSYS payment
eu: REDSYS ordainketaren zain
